app/controllers/notes_controller.rb

    def create
        n = Note.new
        n.title = params[:input_title]
        n.content = params[:input_content]
        n.user = current_user
        n.save
---
INSERT INTO "notes" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "멋쟁이사자처럼"], ["content", "팀원모집중!"], ["created_at", "2018-07-24 04:20:03.251974"], ["updated_at", "2018-07-24 04:20:03.251974"]]

    def study
        @notes = Note.all
---
SELECT "notes".* FROM "notes"